In [2]:
import pandas as pd

In [6]:
s = pd.Series([3, -5, 7, 4], index=[ 'a', 'b','c','d' ])
print(s)

a    3
b   -5
c    7
d    4
dtype: int64

In [8]:
data = {'Country':['China','India','Sri Lanka'],
       'Capital':['Beijing','New Delhi','Colombo'],
       'Population':[1419321278,1452669644,21949268]}
data

{'Country': ['China', 'India', 'Sri Lanka'],
 'Capital': ['Beijing', 'New Delhi', 'Colombo'],
 'Population': [1419321278, 1452669644, 21949268]}

In [14]:
df= pd.DataFrame(data,columns=['Country','Capital','Population'])
df

     Country    Capital  Population
0      China    Beijing  1419321278
1      India  New Delhi  1452669644
2  Sri Lanka    Colombo    21949268

In [15]:
 df.sort_index()

     Country    Capital  Population
0      China    Beijing  1419321278
1      India  New Delhi  1452669644
2  Sri Lanka    Colombo    21949268

In [17]:
 df.sort_values(by='Capital')

     Country    Capital  Population
0      China    Beijing  1419321278
2  Sri Lanka    Colombo    21949268
1      India  New Delhi  1452669644

In [20]:
df.rank()

   Country  Capital  Population
0      1.0      1.0         2.0
1      2.0      3.0         3.0
2      3.0      2.0         1.0

In [21]:
s['b']

-5

In [22]:
df[1:]

     Country    Capital  Population
1      India  New Delhi  1452669644
2  Sri Lanka    Colombo    21949268

In [23]:
 df.ix[2]

AttributeError: 'DataFrame' object has no attribute 'ix'